{
  "status": 200,
  "projects": [
    {
      "id": 1,
      "project_name": "PADC.com.mm",
      "platforms": "Flutter,Kotlin",
      "project_info": "A learning platform for developers with different courses, classes and modules.\nThe platform has a website, an Android app an an iOS app developed in a single codebase using Flutter.\nOptimized the application for iPads and Tablets.\nImplemented Automated tasks to improve efficiency, reduce costs, ensure consistency, scale operations, enhance reliability, reduce risk, and optimize resource usage.\nSuccessfully launched the app to both Android and iOS app stores and also deployed the web application to google cloud",
      "image": "assets/images/padc_preview.png",
      "url": null,
      "android_url": "https://play.google.com/store/apps/details?id=com.padcmyanmar.mm&pcampaignid=web_share",
      "ios_url": null,
      "web_url": "https://padc.mm-digital-solutions.com/#/",
      "record_url": null
    },
    {
      "id": 2,
      "project_name": "Healtppy Telemedicine",
      "platforms": "Flutter,Kotlin",
      "project_info": "A Telemedicine App developed with Flutter. The teleconsultation part of the app is implemented with Android and iOS native components and connected to Flutter.\nThe project includes two different apps used by both patients and doctors.\nContributed to the development of a comprehensive Telemedicine App using Flutter.\nWorking under the leadership of the seniors, I helped implement the core teleconsultation feature, integrating Android components with the Flutter codebase through bridges.\nSuccessfully launched the apps to Android and iOS stores for both patient and doctor apps",
      "image": "assets/images/healtppy_preview.png",
      "url": null,
      "android_url": "https://play.google.com/store/apps/details?id=com.healthppy.patient&pcampaignid=web_share",
      "ios_url": "https://apps.apple.com/mm/app/healtppy-doctor/id1586276589",
      "web_url": null,
      "record_url": null
    },
    {
      "id": 3,
      "project_name": "Digi-Zaay multi-vendoer",
      "platforms": "Flutter",
      "project_info": "A multi-vendor E-commerce platform which is configured at the code base level for multiple stores and vendors \nImplemented in Android Native, iOS Native and Flutter\nThe platform has three different themes from which the store owner can choose their favourite",
      "image": "assets/images/digizay_preview.png",
      "url": null,
      "android_url": null,
      "ios_url": null,
      "web_url": null,
      "record_url": null
    },
    {
      "id": 3,
      "project_name": "The Wechat Redesign App",
      "platforms": "Flutter,Kotlin",
      "project_info": "Undertook the WeChat clone project to enhance my skills in mobile and web application development, with a focus on real-time communication features.Aimed to replicate the core functionalities of WeChat to gain a deeper understanding of how complex, feature-rich applications are built and maintained.Explore and implement various advanced concepts , such as realtime data synchronization, multimedia handling, and user authentication providing me with hands-on experience that significantly strengthened my expertise in Flutter development.",
      "image": "assets/images/wechat_preview.png",
      "url": "https://github.com/PyiTheimKyaw/We-Chat-App.git",
      "android_url": "https://drive.google.com/file/d/17W84BjUmCyqMvFjVi0qNZwcMcb219HkV/view?usp=sharing",
      "ios_url": null,
      "web_url": null,
      "record_url": "https://drive.google.com/file/d/1vNAv9CUwlcSig2W2x1KVMi0avoAYth9B/view?usp=sharing"
    },
    {
      "id": 4,
      "project_name": "The Movie Booking App",
      "platforms": "Flutter",
      "project_info": "Developed a comprehensive movie booking app using Flutter and Kotlin, featuring authentication with Gmail and Facebook. The app allows users to browse and book movie tickets, select seats, choose snacks, and pay securely. Implemented a user-friendly interface with intuitive navigation and integrated barcode generation for ticket confirmation. This project demonstrates my proficiency in cross-platform app development and backend integration for a seamless movie booking experience.",
      "image": "assets/images/movie_booking_preview.png",
      "url": "https://github.com/PyiTheimKyaw/themoviebookingapp.git",
      "android_url": "https://drive.google.com/file/d/1J6zYlju0HAMKt66I4hPBd9gzgUp_qo_p/view?usp=sharing",
      "ios_url": null,
      "web_url": null,
      "record_url": "https://drive.google.com/file/d/1CIYWBvjTVUAJvzT-PQmeHRIj9G9g__-x/view?usp=sharing"
    },
    {
      "id": 5,
      "project_name": "The Library App",
      "platforms": "Flutter",
      "project_info": "Developed a feature-rich clone of the Google Play Books app using Flutter. The app offers a seamless user experience for reading eBooks, with features including a personalized bookshelf, intuitive navigation, adjustable text settings, bookmarks, and search functionality. Implemented efficient state management and ensured high performance across various devices. The project showcases my expertise in mobile app development, particularly in creating complex UI designs and smooth user interactions.",
      "image": "assets/images/library_preview.png",
      "url": "https://github.com/PyiTheimKyaw/google_play_books_app.git",
      "android_url": "https://drive.google.com/file/d/1z3TisTChMLCliYSSbGo9NtzNcj9NSdGX/view?usp=sharing",
      "ios_url": null,
      "web_url": null,
      "record_url": "https://drive.google.com/file/d/1BbvsCpkpxhQ87c3raQevzYM8Yc5GfbN4/view?usp=sharing"
    },
    {
      "id": 6,
      "project_name": "Dreams Dictionary",
      "platforms": "Flutter",
      "project_info": "I have developed an app using the local language (Burmese) that serves as a comprehensive dream dictionary. The app includes various features such as an alphabetical list (from 'က' to 'အ') of dream interpretations, different types of dreams and their meanings, symbols associated with dreams, and a dictionary of dream interpretations. It is designed for those who are not yet familiar with dream symbolism, allowing them to read and understand the meanings of different dreams.",
      "image": "assets/images/dreams_preview.png",
      "url": "https://github.com/PyiTheimKyaw/dreams-api.git",
      "android_url": "https://drive.google.com/file/d/1bRD5ni-Mikq3KgS019DVlaNlRNcLPSjy/view?usp=sharing",
      "ios_url": null,
      "web_url": null,
      "record_url": null
    },
    {
      "id": 7,
      "project_name": "Zodiac",
      "platforms": "Flutter",
      "project_info": "Developed a Zodiac app using Flutter, allowing users to select their birthday and view their corresponding zodiac sign. The app features a detailed view for each zodiac sign, providing comprehensive information about personality traits, compatibility, and daily horoscopes. Implemented a user-friendly interface with smooth navigation and responsive design. This project showcases my skills in Flutter development, UI/UX design, and integrating interactive features to enhance user engagement.",
      "image": "assets/images/zodiac_preview.png",
      "url": "https://github.com/PyiTheimKyaw/Zodiac.git",
      "android_url": "https://drive.google.com/file/d/1XEE8Uf2yV4KVpgmVU_d5W2_tQiLmtegj/view?usp=sharing",
      "ios_url": null,
      "web_url": null,
      "record_url": null
    }
  ]
}
